# In Emacs org-mode: before exporting, comment this out START
;; Local Variables:
;; ispell-check-comments: exclusive
;; ispell-local-dictionary: "english"
;; End:
# In Emacs org-mode: before exporting, comment this out FINISH

# Org-mode Export LaTeX Customization Notes:
# - Interpret 'bla_bla' as LaTeX Math bla subscript bla: #+OPTIONS ^:t. Interpret literally bla_bla: ^:nil.
# - org export: turn off heading -> section numbering: #+OPTIONS: num:nil
# - org export: change list numbering to alphabetical, sources:
#   - https://orgmode.org/manual/Plain-lists-in-LaTeX-export.html
#   - https://tex.stackexchange.com/a/129960
#   - must be inserted before each list:
#     #+ATTR_LATEX: :environment enumerate
#     #+ATTR_LATEX: :options [label=\alph*)]
# - allow org to recognize alphabetical lists a)...: M-x customize-variable org-list-allow-alphabetical


# -----------------------
# General Export Options:
#+OPTIONS: ^:nil ':nil *:t -:t ::t <:t H:3 \n:nil arch:headline 
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: f:t inline:t p:nil pri:nil prop:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t title:t todo:t |:t

#+OPTIONS: author:Johannes Wasmer
#+OPTIONS: email:johannes.wasmer@gmail.com

#+OPTIONS: num:t
# t or nil: disable export latex section numbering for org headings
#+OPTIONS: toc:t
# t or nil: no table of contents (doesn't work if num:nil)

#+TITLE: Python_Snippets_Notes
#+DATE: <2020-11-21 Sat>
#+AUTHOR: Johannes Wasmer
# #+EMAIL: johannes.wasmer@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.2.2 (Org mode 9.1.13)

# ---------------------
# LaTeX Export Options:
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \usepackage[top=0.5in,bottom=0.5in,left=1in,right=1in,includeheadfoot]{geometry} % wider page; load BEFORE fancyhdr
** reference project setup
[[file:wasmerj/manual_imports_v1/][project folder]]

project setup:
#+begin_src bash :results output
tree ./wasmerj/manual_imports_v1
#+end_src

#+RESULTS:
#+begin_example
./wasmerj/manual_imports_v1
├── foo
│   ├── bar.py
│   └── __pycache__
│       └── bar.cpython-37.pyc
├── interpreter.ipynb
├── main.py
├── _MARKER_project_rootDir
├── u
│   └── v
│       └── script.py
└── x
    └── y

6 directories, 6 files
#+end_example

The branch ~x/y/~ is for simulating a location with same relative path ~../../~
to ~foo~ as ~u/v/~

content of ~foo/bar.py~:
#+begin_src bash :results output code
cat ./wasmerj/manual_imports_v1/foo/bar.py
#+end_src

#+RESULTS:
#+begin_src bash
class Foo:
    def bar(self):
        print("foobar")
#+end_src

content of ~main.py~:
#+begin_src bash :results output code
cat ./wasmerj/manual_imports_v1/main.py
#+end_src

#+RESULTS:
#+begin_src bash
from foo.bar import Foo

if __name__ == '__main__':
    foo = Foo()
    foo.bar()
#+end_src

content of ~u/v/script.py~: depends on the solution.

Important to note: calling ~main.py~ is callable from any location. The
solutions differ in the following: ~script.py~ is ...
- ... not callable (error = foo.bar not found = default)
- ... callable only from its location. calling it from another folder results in error.
- ... callable from any location.
** attribute init order
#+BEGIN_SRC python :results output
from abc import ABC, abstractmethod
from enum import Enum
class T(Enum):
    B = 1
    C = 2
class A(ABC):
    def __init__(self):
        if not hasattr(self, 'a'):
            self.a = set()
        print(f"init A.a: {self.a}")
    def f(self):
        check = ['d','dd']
        print(f"f: 'd','dd' in a: {any(c in self.a for c in check)}\n")
        print(self.a)
class B(A):
    def __init__(self):
        A.__init__(self)
        self.a.update('b')
        print(f"init B.a: {self.a}")
class D(A):
    def __init__(self):
        A.__init__(self)
        self.a.update('d')
        print(f"init D.a: {self.a}")
class BD(B,D):
    def __init__(self):
        D.__init__(self)
        B.__init__(self)
        print(f"init BD.a: {self.a}")
        

        
b = B()
b.f()

d = D()
d.f()

bd = BD()
bd.f()

print(bd.a)
#+END_SRC

#+RESULTS:
#+begin_example
init A.a: set()
init B.a: {'b'}
f: 'd','dd' in a: False

{'b'}
init A.a: set()
init D.a: {'d'}
f: 'd','dd' in a: True

{'d'}
init A.a: set()
init D.a: {'d'}
init A.a: {'d'}
init B.a: {'d', 'b'}
init BD.a: {'d', 'b'}
f: 'd','dd' in a: True

{'d', 'b'}
{'d', 'b'}
#+end_example
** multiple inheritance: method inheritance order
A derived class uses the matching overwritten method of the first derived class.
#+BEGIN_SRC python :results output
from abc import ABC, abstractmethod

class A(ABC):
    @abstractmethod
    def f(self):
        print("A")
class B(A):
    def f(self):
        print("B")
class C(A):
    def f(self):
        print("C")
class D(B,C):
    pass
class E(C,B):
    pass

d = D()
d.f()
e = E()
e.f()
#+END_SRC

#+RESULTS:
: B
: C
